app/controllers/movies_controller.rb

  def index
   # @movies = Movie.all
   if params[:sort]
    @movies = Movie.order("#{params[:sort]} ASC")
---
SELECT "movies".* FROM "movies" ORDER BY #{params[:sort]} ASC